package location

var (
	MAP_AREANAME_PARSE = map[string]string{
		"广东":           "广东省",
		"江苏":           "江苏省",
		"河南":           "河南省",
		"浙江":           "浙江省",
		"山东":           "山东省",
		"河北":           "河北省",
		"福建":           "福建省",
		"北京":           "北京市",
		"安徽":           "安徽省",
		"湖北":           "湖北省",
		"四川":           "四川省",
		"山西":           "山西省",
		"上海":           "上海市",
		"江西":           "江西省",
		"辽宁":           "辽宁省",
		"湖南":           "湖南省",
		"广西":           "广西壮族自治区",
		"陕西":           "陕西省",
		"黑龙江":          "黑龙江省",
		"吉林":           "吉林省",
		"云南":           "云南省",
		"内蒙古":          "内蒙古自治区",
		"贵州":           "贵州省",
		"重庆":           "重庆市",
		"天津":           "天津市",
		"甘肃":           "甘肃省",
		"海南":           "海南省",
		"中国":           "中国",
		"新疆":           "新疆维吾尔自治区",
		"宁夏":           "宁夏回族自治区",
		"青海":           "青海省",
		"西藏":           "西藏自治区",
		"香港":           "香港特别行政区",
		"澳门":           "澳门特别行政区",
		"台湾":           "台湾省",
		"香港特別行政區":      "香港特别行政区",
		"澳門特別行政區":      "澳门特别行政区",
		"Beijing":      "北京市",
		"Guangdong":    "广东省",
		"Shanghai":     "上海市",
		"Yunnan":       "云南省",
		"Anhui":        "安徽省",
		"Jiangxi":      "江西省",
		"Guangxi":      "广西壮族自治区",
		"Xinjiang":     "新疆维吾尔自治区",
		"Shandong":     "山东省",
		"Liaoning":     "辽宁省",
		"Heilongjiang": "黑龙江省",
		"Tianjin":      "天津市",
		"Jiangsu":      "江苏省",
		"Sichuann":     "四川省",
		"Hubei":        "湖北省",

		"广东省":      "广东省",
		"江苏省":      "江苏省",
		"河南省":      "河南省",
		"浙江省":      "浙江省",
		"山东省":      "山东省",
		"河北省":      "河北省",
		"福建省":      "福建省",
		"北京市":      "北京市",
		"安徽省":      "安徽省",
		"湖北省":      "湖北省",
		"四川省":      "四川省",
		"山西省":      "山西省",
		"上海市":      "上海市",
		"江西省":      "江西省",
		"辽宁省":      "辽宁省",
		"湖南省":      "湖南省",
		"广西壮族自治区":  "广西壮族自治区",
		"陕西省":      "陕西省",
		"黑龙江省":     "黑龙江省",
		"吉林省":      "吉林省",
		"云南省":      "云南省",
		"内蒙古自治区":   "内蒙古自治区",
		"贵州省":      "贵州省",
		"重庆市":      "重庆市",
		"天津市":      "天津市",
		"甘肃省":      "甘肃省",
		"海南省":      "海南省",
		"新疆维吾尔自治区": "新疆维吾尔自治区",
		"宁夏回族自治区":  "宁夏回族自治区",
		"青海省":      "青海省",
		"西藏自治区":    "西藏自治区",
		"香港特别行政区":  "香港特别行政区",
		"澳门特别行政区":  "澳门特别行政区",
		"台湾省":      "台湾省",
	}
)

func ParseProvince(name string) (string, bool) {
	province, found := MAP_AREANAME_PARSE[name]
	if found {
		return province, true
	} else {
		return name, false
	}
}

func MustParseProvince(name string) string {
	province, _ := ParseProvince(name)
	return province
}

func MustParseCity(name string) string {
	adcode := GetAdcode(name)
	if adcode != "" {
		return name
	}

	adcode = GetAdcode(name + "市")
	if adcode != "" {
		return name + "市"
	}

	return name
}
